k6_chaos_result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: 10 looping VUs for 50s (gracefulStop: 30s)

time="2026-04-07T13:43:28Z" level=info msg="[SETUP] Khởi tạo SRE JWT Token: SUCCESS" source=console

running (0m01.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  00.9s/50s

running (0m02.0s), 10/10 VUs, 21 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  01.9s/50s

running (1m36.6s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  02.9s/50s

running (0m04.3s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  03.9s/50s

running (0m05.3s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  04.9s/50s

running (0m06.3s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  05.9s/50s

running (0m07.3s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  06.9s/50s

running (1m41.6s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  07.9s/50s

running (0m09.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  08.9s/50s

running (0m10.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  09.9s/50s

running (0m11.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  10.9s/50s

running (0m12.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  11.9s/50s

running (1m46.6s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  12.9s/50s

running (1m47.6s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  13.9s/50s

running (1m48.6s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  14.9s/50s

running (1m49.6s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  15.9s/50s

running (1m50.6s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  16.9s/50s

running (1m51.6s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  17.9s/50s

running (1m52.6s), 10/10 VUs, 360 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  18.9s/50s

running (0m20.3s), 10/10 VUs, 380 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  19.9s/50s

running (0m21.3s), 10/10 VUs, 400 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  20.9s/50s

running (0m22.3s), 10/10 VUs, 420 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  21.9s/50s

running (1m56.6s), 10/10 VUs, 440 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  22.9s/50s

running (0m24.0s), 10/10 VUs, 460 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  23.9s/50s

running (0m25.0s), 10/10 VUs, 480 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  24.9s/50s

running (0m26.0s), 10/10 VUs, 500 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  25.9s/50s

running (0m27.0s), 10/10 VUs, 512 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  26.9s/50s

running (2m01.6s), 10/10 VUs, 530 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  27.9s/50s

running (0m29.1s), 10/10 VUs, 550 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  28.9s/50s

running (0m30.1s), 10/10 VUs, 570 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  29.9s/50s

running (0m31.1s), 10/10 VUs, 590 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  30.9s/50s

running (0m32.1s), 10/10 VUs, 610 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  31.9s/50s

running (2m06.6s), 10/10 VUs, 630 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  32.9s/50s

running (0m34.0s), 10/10 VUs, 650 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  33.9s/50s

running (0m35.0s), 10/10 VUs, 670 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  34.9s/50s

running (0m36.0s), 10/10 VUs, 690 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  35.9s/50s

running (0m37.0s), 10/10 VUs, 710 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  36.9s/50s

running (2m11.6s), 10/10 VUs, 730 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  37.9s/50s

running (0m39.0s), 10/10 VUs, 750 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  38.9s/50s

running (0m40.0s), 10/10 VUs, 770 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  39.9s/50s

running (0m41.0s), 10/10 VUs, 790 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  40.9s/50s

running (0m42.0s), 10/10 VUs, 810 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  41.9s/50s

running (2m16.6s), 10/10 VUs, 830 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  42.9s/50s

running (0m44.2s), 10/10 VUs, 850 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  43.9s/50s

running (0m45.2s), 10/10 VUs, 870 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  44.9s/50s

running (0m46.2s), 10/10 VUs, 890 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  45.9s/50s

running (0m47.2s), 10/10 VUs, 910 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  46.9s/50s

running (2m21.6s), 10/10 VUs, 930 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  47.9s/50s

running (0m49.1s), 10/10 VUs, 950 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  48.9s/50s

running (0m50.1s), 10/10 VUs, 970 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  49.9s/50s


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.15' rate=99.89%


  █ TOTAL RESULTS 

    checks_total.......: 1960    38.741767/s
    checks_succeeded...: 0.00%   0 out of 1960
    checks_failed......: 100.00% 1960 out of 1960

    ✗ Tạo đơn hàng thành công (201)
      ↳  0% — ✓ 0 / ✗ 980
    ✗ Ngắt quãng (5xx)
      ↳  0% — ✓ 0 / ✗ 980

    HTTP
    http_req_duration..............: avg=13.01ms  min=144.37µs med=8.33ms   max=374.16ms p(90)=15.49ms  p(95)=18.72ms 
      { expected_response:true }...: avg=112.25ms min=112.25ms med=112.25ms max=112.25ms p(90)=112.25ms p(95)=112.25ms
    http_req_failed................: 99.89% 980 out of 981
    http_reqs......................: 981    19.39065/s

    EXECUTION
    iteration_duration.............: avg=513.86ms min=503.49ms med=509.18ms max=876.12ms p(90)=516.29ms p(95)=519.59ms
    iterations.....................: 980    19.370884/s
    vus............................: 10     min=10         max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 542 kB 11 kB/s
    data_sent......................: 493 kB 9.7 kB/s



running (0m50.6s), 00/10 VUs, 980 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  50s
time="2026-04-07T13:44:19Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"